Revit 2025 API
WorksharingDisplaySettings.SetGraphicOverrides(CheckoutStatus, WorksharingDisplayGraphicSettings) Method
 Sets the graphic overrides assigned to elements with a particular ownership status.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void SetGraphicOverrides(
	CheckoutStatus status,
	WorksharingDisplayGraphicSettings overrides
)
Public Sub SetGraphicOverrides (
	status As CheckoutStatus,
	overrides As WorksharingDisplayGraphicSettings
)
public:
void SetGraphicOverrides(
	CheckoutStatus status,
	WorksharingDisplayGraphicSettings^ overrides
)
member SetGraphicOverrides :
        status : CheckoutStatus *
        overrides : WorksharingDisplayGraphicSettings -> unit
Parameters
status CheckoutStatus
 The ownership status of interest.
overrides WorksharingDisplayGraphicSettings
 The desired graphic overrides for this ownership status.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Example
public void SetWorksharingDisplaySettings(Document doc, WorksetId worksetId, String userName)
{
    String message = String.Empty;
    // get or create a WorksharingDisplaySettings current active document
    WorksharingDisplaySettings displaySettings = WorksharingDisplaySettings.GetOrCreateWorksharingDisplaySettings(doc);
    // set a new graphicSettings for CheckoutStatus - NotOwned
    WorksharingDisplayGraphicSettings graphicSettings = new WorksharingDisplayGraphicSettings(true, new Color(255, 0, 0));
    displaySettings.SetGraphicOverrides(CheckoutStatus.NotOwned, graphicSettings);
    // set a new graphicSettings for ModelUpdatesStatus - CurrentWithCentral
    graphicSettings = new WorksharingDisplayGraphicSettings(true, new Color(128, 128, 0));
    displaySettings.SetGraphicOverrides(ModelUpdatesStatus.CurrentWithCentral, graphicSettings);
    // set a new graphicSettings by a given userName
    graphicSettings = new WorksharingDisplayGraphicSettings(true, new Color(0, 255, 0));
    displaySettings.SetGraphicOverrides(userName, graphicSettings);
    // set a new graphicSettings by a given workset Id
    graphicSettings = new WorksharingDisplayGraphicSettings(true, new Color(0, 0, 255));
    displaySettings.SetGraphicOverrides(worksetId, graphicSettings);
}
Public Sub SetWorksharingDisplaySettings(doc As Document, worksetId As WorksetId, userName As [String])
    Dim message As [String] = [String].Empty
    ' get or create a WorksharingDisplaySettings current active document
    Dim displaySettings As WorksharingDisplaySettings = WorksharingDisplaySettings.GetOrCreateWorksharingDisplaySettings(doc)
    ' set a new graphicSettings for CheckoutStatus - NotOwned
    Dim graphicSettings As New WorksharingDisplayGraphicSettings(True, New Color(255, 0, 0))
    displaySettings.SetGraphicOverrides(CheckoutStatus.NotOwned, graphicSettings)
    ' set a new graphicSettings for ModelUpdatesStatus - CurrentWithCentral
    graphicSettings = New WorksharingDisplayGraphicSettings(True, New Color(128, 128, 0))
    displaySettings.SetGraphicOverrides(ModelUpdatesStatus.CurrentWithCentral, graphicSettings)
    ' set a new graphicSettings by a given userName
    graphicSettings = New WorksharingDisplayGraphicSettings(True, New Color(0, 255, 0))
    displaySettings.SetGraphicOverrides(userName, graphicSettings)
    ' set a new graphicSettings by a given workset Id
    graphicSettings = New WorksharingDisplayGraphicSettings(True, New Color(0, 0, 255))
    displaySettings.SetGraphicOverrides(worksetId, graphicSettings)
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
WorksharingDisplaySettings Class
SetGraphicOverrides Overload
Autodesk.Revit.DB Namespace